import cv2
import numpy as np

# 繪製500x500的畫布
image = np.zeros((500, 500, 3), dtype = "uint8")

# 將影像用淺灰色填滿
image.fill(200)

# 繪製線條
cv2.line(image, (50, 250), (450, 250), (0, 255, 255), 5)  # 參數依序是：影像, 開始座標, 結束座標, 顏色, 線條寬度

# 繪製空心矩形
cv2.rectangle(image, (60, 60), (120, 180), (0, 255, 0), 3)  # 參數依序是：影像, 頂點座標, 對向頂點座標, 顏色, 線條寬度

# 繪製實心矩形
cv2.rectangle(image, (80, 80), (100, 160), (0, 255, 0), -1)

# 繪製空心圓圈
cv2.circle(image, (400, 400), 50, (255, 255, 0), 3)  # 參數依序是：影像, 圓心座標, 半徑, 顏色, 線條寬度

# 繪製實心圓圈
cv2.circle(image, (400, 400), 40, (255, 255, 0), -1)

# 繪製空心橢圓形
cv2.ellipse(image, (400, 150), (30, 60), 45, 0, 360, (255, 0, 255), 2)  # 參數依序是：影像, 中心座標, 軸長, 旋轉角度, 起始角度, 結束角度, 顏色, 線條寬度

# 繪製實心橢圓形
cv2.ellipse(image, (400, 150), (20, 50), 45, 0, 180, (255, 0, 255), -1)

# 設定折線座標
pc = np.array([[200, 60], [300, 100], [250, 300], [220, 200], [170, 100]], np.int32)

# 改變陣列形狀，將座標轉為(頂點數量, 1, 2)的陣列
pc = pc.reshape((-1, 1, 2))
print(pc)

# 繪製多邊形
cv2.polylines(image, [pc], True, (0, 0, 0), 4)  # 參數依序是：影像, 頂點座標, 封閉型, 顏色, 線條寬度

# 添加文字
cv2.putText(image, "Hello!", (10, 40), cv2.FONT_HERSHEY_SIMPLEX, 1, (255, 255, 255), 1, cv2.LINE_AA)  # 影像, 文字, 座標, 字型, 大小, 顏色, 線條寬度, 線條種類

# 顯示影像
cv2.imshow("ImageView", image)  # 使用名為ImageView的視窗標題名稱

# 等待按鍵事件，按任意鍵關閉影像視窗
cv2.waitKey(0)
cv2.destroyAllWindows()